Revit 2027 API
ConduitSettings.SizeSuffix Property
 The conduit size suffix string.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SizeSuffix { get; set; }
Public Property SizeSuffix As String
	Get
	Set
public:
property String^ SizeSuffix {
	String^ get ();
	void set (String^ value);
}
member SizeSuffix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ConduitSettings Class
Autodesk.Revit.DB.Electrical Namespace